خانه
کلاس‌ها
طراحی
و
پیاده
سازی
الگوریتمها
خود
آزمایی
اول
‍ ‍
امکان
تغییر
ارسال
نهایی
بعد
از
پایان
مهلت
تمرین
وجود
ندارد.

همه
مسائل

همه
انواع
فایل
ارسال
نهایی
مسئله
زمان
ارسال
ضریب
نمره
(تاخیر)
نمره
داوری
نوع
فایل
وضعیت
فایل
نمره
خام
نمره
با
تاخیر

خرید
سال
نو  ۱۲ اسفند ۱۳۹۶ ساعت ۰۹:۰۳  ۱۰۰٪
۱۰۰  ۱۰۰  C + +  ۱۰۰

خرید
سال
نو  ۱۲ اسفند ۱۳۹۶ ساعت ۰۸:۵۷  ۱۰۰٪
۲۵  ۲۵  C + +  ۲۵

خرید
سال
نو  ۱۲ اسفند ۱۳۹۶ ساعت ۰۸:۴۸  ۱۰۰٪
۲۵  ۲۵  C + +  ۲۵

خرید
سال
نو  ۱۲ اسفند ۱۳۹۶ ساعت ۰۸:۳۹  ۱۰۰٪
۲۵  ۲۵  C + +  ۲۵

وارونگی  ۱۲ اسفند ۱۳۹۶ ساعت ۰۸:۳۸  ۱۰۰٪
۰  ۰  C + +  ۰

خرید
سال
نو  ۱۲ اسفند ۱۳۹۶ ساعت ۰۸:۳۵  ۱۰۰٪
۲۵  ۲۵  C + +  ۲۵

خرید
سال
نو  ۱۲ اسفند ۱۳۹۶ ساعت ۰۸:۳۰  ۱۰۰٪
۲۵  ۲۵  C + +  ۲۵

وارونگی  ۱۲ اسفند ۱۳۹۶ ساعت ۰۸:۲۱  ۱۰۰٪
۲۰  ۲۰  C + +  ۲۰


کلاس‌ها
سؤالات
مسابقات
شرکت‌ها
فرصت‌های
شغلی
بلاگ
درباره
ما
تماس
با
ما
قوانین
و
مقررات

Untitled3.cpp | submission
id: 997129

# include<bits/stdc++.h>
using
namespace
std;
typedef
long
long
ll;

int
main()
{
    ll
m, n;
vector < long
long > v;
ll
a;
cin»m»n;
for (int
i = 0;
i < n;
i + +){
    cin»a;
v.push_back(a);
}
sort(v.begin(), v.end());
int i, j;
i = 0;
j = n - 1;
ll
c = 0;
while (i < j){
if (v[i]+v[j] == m){

// j--;
i++;
c++;
}
else if (v[i]+v[j] < m){
i++;
}
else j--;
// cout«i«" "«j«endl;
}

cout«c;

}